NoMaY-jp/amazon-freertos-ex1/lib/pkcs11/portable/renesas/rx65n-envision-kit/pkcs11.c
/*
 * Amazon FreeRTOS PKCS#11 V1.0.0
 * Copyright (C) 2018 Amazon.com, Inc. or its affiliates.  All Rights Reserved.
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy of
 * this software and associated documentation files (the "Software"), to deal in
 * the Software without restriction, including without limitation the rights to
 * use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of
 * the Software, and to permit persons to whom the Software is furnished to do so,
 * subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in all
 * copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS
 * FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR
 * COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER
 * IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
 * CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
 *
 * http://aws.amazon.com/freertos
 * http://www.FreeRTOS.org
 */

/**
 * @file pkcs11.c
 * @brief PKCS11 Interface.
 */

/* FreeRTOS includes. */
#include "FreeRTOS.h"
#include "FreeRTOSIPConfig.h"
#include "task.h"
#include "aws_crypto.h"
#include "aws_pkcs11.h"

/* mbedTLS includes. */
#include "mbedtls/pk.h"
#include "mbedtls/pk_internal.h"
#include "mbedtls/x509_crt.h"
#include "mbedtls/ctr_drbg.h"
#include "mbedtls/entropy.h"
#include "mbedtls/sha256.h"
#include "mbedtls/base64.h"
#include "aws_clientcredential.h"

/* C runtime includes. */
#include <stdio.h>
#include <string.h>

/* Renesas */
#include "r_flash_rx_if.h"

/**
 * @brief File storage location definitions.
 */
#define pkcs11FILE_NAME_CLIENT_CERTIFICATE    "FreeRTOS_P11_Certificate.dat"
#define pkcs11FILE_NAME_KEY                   "FreeRTOS_P11_Key.dat"

/**
 * @brief Cryptoki module attribute definitions.
 */
#define pkcs11SLOT_ID                         1
#define pkcs11OBJECT_HANDLE_PUBLIC_KEY        1
#define pkcs11OBJECT_HANDLE_PRIVATE_KEY       2
#define pkcs11OBJECT_HANDLE_CERTIFICATE       3

#define pkcs11SUPPORTED_KEY_BITS              2048

typedef int ( * pfnMbedTlsSign )( void * ctx,
                                  mbedtls_md_type_t md_alg,
                                  const unsigned char * hash,
                                  size_t hash_len,
                                  unsigned char * sig,
                                  size_t * sig_len,
                                  int ( *f_rng )( void *, unsigned char *, size_t ),
                                  void * p_rng );

/**
 * @brief Key structure.
 */
typedef struct P11Key
{
    mbedtls_pk_context xMbedPkCtx;
    mbedtls_x509_crt xMbedX509Cli;
    mbedtls_pk_info_t xMbedPkInfo;
    pfnMbedTlsSign pfnSavedMbedSign;
    void * pvSavedMbedPkCtx;
} P11Key_t, * P11KeyPtr_t;

/**
 * @brief Session structure.
 */
typedef struct P11Session
{
    P11KeyPtr_t pxCurrentKey;
    CK_ULONG ulState;
    CK_BBOOL xOpened;
    CK_BBOOL xFindObjectInit;
    CK_BBOOL xFindObjectComplete;
    CK_OBJECT_CLASS xFindObjectClass;
    mbedtls_ctr_drbg_context xMbedDrbgCtx;
    mbedtls_entropy_context xMbedEntropyContext;
} P11Session_t, * P11SessionPtr_t;

/*-----------------------------------------------------------*/

// XXX Renesas Ishiguro

#define pkcs11OBJECT_CERTIFICATE_MAX_SIZE     2048
#define pkcs11OBJECT_FLASH_CERT_PRESENT       ( 0xABCDEFuL )
/**
 * @brief Structure for certificates/key storage.
 */
typedef struct
{
    CK_CHAR cDeviceCertificate[ pkcs11OBJECT_CERTIFICATE_MAX_SIZE ];
    CK_CHAR cDeviceKey[ pkcs11OBJECT_CERTIFICATE_MAX_SIZE ];
    CK_ULONG ulDeviceCertificateMark;
    CK_ULONG ulDeviceKeyMark;
} P11KeyConfig_t;

#pragma section C UNINIT_FIXED_LOC
P11KeyConfig_t P11KeyConfig;
#pragma section

int FLASH_update(uint32_t dst_addr, const void *data, uint32_t size);
// XXX Renesas Ishiguro

/**
 * @brief Maps an opaque caller session handle into its internal state structure.
 */
static P11SessionPtr_t prvSessionPointerFromHandle( CK_SESSION_HANDLE xSession )
{
    return ( P11SessionPtr_t ) xSession; /*lint !e923 Allow casting integer type to pointer for handle. */
}

/*-----------------------------------------------------------*/

/**
 * @brief Writes a file to local storage.
 */
static BaseType_t prvSaveFile( char * pcFileName,
                               uint8_t * pucData,
                               uint32_t ulDataSize )
{
	// XXX Renesas Ishiguro
    CK_RV xResult = pdFALSE;
    CK_RV xBytesWritten = 0;
    CK_ULONG ulFlashMark = pkcs11OBJECT_FLASH_CERT_PRESENT;

    /*
     * write client certificate.
     */

    if( strncmp( pcFileName,
                 pkcs11FILE_NAME_CLIENT_CERTIFICATE,
                 strlen( pkcs11FILE_NAME_CLIENT_CERTIFICATE ) ) == 0 )
    {
        xBytesWritten = FLASH_update( ( uint32_t ) P11KeyConfig.cDeviceCertificate,
                                      pucData,
                                      ( ulDataSize + 1 ) ); /*Include '\0'*/

        if( xBytesWritten == ( ulDataSize + 1 ) )
        {
            xResult = pdTRUE;

            /*change flash written mark'*/
            FLASH_update( ( uint32_t ) &P11KeyConfig.ulDeviceCertificateMark,
                          &ulFlashMark,
                          sizeof( CK_ULONG ) );
        }
    }

    /*
     * write client key.
     */

    if( strncmp( pcFileName,
                 pkcs11FILE_NAME_KEY,
                 strlen( pkcs11FILE_NAME_KEY ) ) == 0 )
    {
        xBytesWritten = FLASH_update( ( uint32_t ) P11KeyConfig.cDeviceKey,
                                      pucData,
                                      ulDataSize + 1 ); /*Include '\0'*/

        if( xBytesWritten == ( ulDataSize + 1 ) )
        {
            xResult = pdTRUE;

            /*change flash written mark'*/
            FLASH_update( ( uint32_t ) &P11KeyConfig.ulDeviceKeyMark,
                          &ulFlashMark,
                          sizeof( CK_ULONG ) );
        }
    }

    return xResult;
    // XXX Renesas Ishiguro
}

/*-----------------------------------------------------------*/

/**
 * @brief Reads a file from local storage.
 */
static BaseType_t prvReadFile( char * pcFileName,
                               uint8_t ** ppucData,
                               uint32_t * pulDataSize )
{
	// XXX Renesas Ishiguro
	CK_RV xResult = pdFALSE;

