NoMaY-jp/amazon-freertos-ex1/lib/pkcs11/portable/renesas/rx65n-envision-kit/pkcs11.c
	/*
	 * Read client certificate.
	 */

	if( strncmp( pcFileName,
				 pkcs11FILE_NAME_CLIENT_CERTIFICATE,
				 strlen( pkcs11FILE_NAME_CLIENT_CERTIFICATE ) ) == 0 )
	{
		/*
		 * return reference and size only if certificates are present in flash
		 */
		if( P11KeyConfig.ulDeviceCertificateMark == pkcs11OBJECT_FLASH_CERT_PRESENT )
		{
			*ppucData = P11KeyConfig.cDeviceCertificate;
			*pulDataSize = ( uint32_t ) strlen( ( const char * ) P11KeyConfig.cDeviceCertificate ) + 1;
			xResult = pdTRUE;
		}
	}

	/*
	 * Read client key.
	 */

	if( strncmp( pcFileName,
				 pkcs11FILE_NAME_KEY,
				 strlen( pkcs11FILE_NAME_KEY ) ) == 0 )
	{
		/*
		 * return reference and size only if certificates are present in flash
		 */
		if( P11KeyConfig.ulDeviceKeyMark == pkcs11OBJECT_FLASH_CERT_PRESENT )
		{
			*ppucData = P11KeyConfig.cDeviceKey;
			*pulDataSize = ( uint32_t ) strlen( ( const char * ) P11KeyConfig.cDeviceKey ) + 1;
			xResult = pdTRUE;
		}
	}

	return xResult;
	// XXX Renesas Ishiguro
}

/*-----------------------------------------------------------*/

/**
 * @brief Sign a cryptographic hash with the private key.
 *
 * @param[in] pvContext Crypto context.
 * @param[in] xMdAlg Unused.
 * @param[in] pucHash Length in bytes of hash to be signed.
 * @param[in] uiHashLen Byte array of hash to be signed.
 * @param[out] pucSig RSA signature bytes.
 * @param[in] pxSigLen Length in bytes of signature buffer.
 * @param[in] piRng Unused.
 * @param[in] pvRng Unused.
 *
 * @return Zero on success.
 */
static int prvPrivateKeySigningCallback( void * pvContext,
                                         mbedtls_md_type_t xMdAlg,
                                         const unsigned char * pucHash,
                                         unsigned int uiHashLen,
                                         unsigned char * pucSig,
                                         size_t * pxSigLen,
                                         int ( *piRng )( void *, unsigned char *, size_t ), /*lint !e955 This parameter is unused. */
                                         void * pvRng )
{
    BaseType_t xResult = 0;
    P11SessionPtr_t pxSession = ( P11SessionPtr_t ) pvContext;
    CK_MECHANISM xMech = { 0 };

    /* Unreferenced parameters. */
    ( void ) ( piRng );
    ( void ) ( pvRng );
    ( void ) ( xMdAlg );

    /* Use the PKCS#11 module to sign. */
    xMech.mechanism = CKM_SHA256;

    xResult = ( BaseType_t ) C_SignInit(
        ( CK_SESSION_HANDLE ) pxSession,
        &xMech,
        ( CK_OBJECT_HANDLE ) pxSession->pxCurrentKey );

    if( 0 == xResult )
    {
        xResult = ( BaseType_t ) C_Sign(
            ( CK_SESSION_HANDLE ) pxSession,
            ( CK_BYTE_PTR ) pucHash, /*lint !e9005 The interfaces are from 3rdparty libraries, we are not suppose to change them. */
            uiHashLen,
            pucSig,
            ( CK_ULONG_PTR ) pxSigLen );
    }

    return xResult;
}

/*-----------------------------------------------------------*/

/**
 * @brief Initializes a key structure.
 */
static CK_RV prvInitializeKey( P11SessionPtr_t pxSessionObj,
                               const char * pcEncodedKey,
                               const uint32_t ulEncodedKeyLength,
                               const char * pcEncodedCertificate,
                               const uint32_t ulEncodedCertificateLength )
{
    CK_RV xResult = 0;

    /*
     * Create the key structure, but allow an existing one to be used.
     */

    if( NULL == pxSessionObj->pxCurrentKey )
    {
        if( NULL == ( pxSessionObj->pxCurrentKey = ( P11KeyPtr_t ) pvPortMalloc(
                          sizeof( P11Key_t ) ) ) ) /*lint !e9087 Allow casting void* to other types. */
        {
            xResult = CKR_HOST_MEMORY;
        }
    }

    /*
     * Initialize the key field, if requested.
     */

    if( ( CKR_OK == xResult ) && ( NULL != pcEncodedKey ) )
    {
        memset( pxSessionObj->pxCurrentKey, 0, sizeof( P11Key_t ) );
        mbedtls_pk_init( &pxSessionObj->pxCurrentKey->xMbedPkCtx );

        if( 0 != mbedtls_pk_parse_key(
                &pxSessionObj->pxCurrentKey->xMbedPkCtx,
                ( const unsigned char * ) pcEncodedKey,
                ulEncodedKeyLength,
                NULL,
                0 ) )
        {
            xResult = CKR_FUNCTION_FAILED;
        }

        if( CKR_OK == xResult )
        {
            /* Swap out the signing function pointer. */
            memcpy(
                &pxSessionObj->pxCurrentKey->xMbedPkInfo,
                pxSessionObj->pxCurrentKey->xMbedPkCtx.pk_info,
                sizeof( pxSessionObj->pxCurrentKey->xMbedPkInfo ) );
            pxSessionObj->pxCurrentKey->pfnSavedMbedSign = pxSessionObj->pxCurrentKey->xMbedPkInfo.sign_func;
            pxSessionObj->pxCurrentKey->xMbedPkInfo.sign_func = prvPrivateKeySigningCallback;
            pxSessionObj->pxCurrentKey->xMbedPkCtx.pk_info = &pxSessionObj->pxCurrentKey->xMbedPkInfo;

            /* Swap out the underlying internal key context. */
            pxSessionObj->pxCurrentKey->pvSavedMbedPkCtx = pxSessionObj->pxCurrentKey->xMbedPkCtx.pk_ctx;
            pxSessionObj->pxCurrentKey->xMbedPkCtx.pk_ctx = pxSessionObj;
        }
    }

    /*
     * Initialize the certificate field, if requested.
     */

    if( ( CKR_OK == xResult ) && ( NULL != pcEncodedCertificate ) )
    {
        mbedtls_x509_crt_init( &pxSessionObj->pxCurrentKey->xMbedX509Cli );

        if( 0 != mbedtls_x509_crt_parse(
                &pxSessionObj->pxCurrentKey->xMbedX509Cli,
                ( const unsigned char * ) pcEncodedCertificate,
                ulEncodedCertificateLength ) )
        {
            xResult = CKR_FUNCTION_FAILED;
        }
    }

    return xResult;
}

/*-----------------------------------------------------------*/

/**
 * @brief Load the default key and certificate from storage.
 */
static CK_RV prvLoadAndInitializeDefaultCertificateAndKey( P11SessionPtr_t pxSession )
{
    CK_RV xResult = 0;
    uint8_t * pucCertificateData = NULL;
    uint32_t ulCertificateDataLength = 0;
    BaseType_t xFreeCertificate = pdFALSE;
    uint8_t * pucKeyData = NULL;
    uint32_t ulKeyDataLength = 0;
    BaseType_t xFreeKey = pdFALSE;

    /* Read the certificate from storage. */
    if( pdFALSE == prvReadFile( pkcs11FILE_NAME_CLIENT_CERTIFICATE,
                                &pucCertificateData,
                                &ulCertificateDataLength ) )
    {
        pucCertificateData = ( uint8_t * ) clientcredentialCLIENT_CERTIFICATE_PEM;
        ulCertificateDataLength = clientcredentialCLIENT_CERTIFICATE_LENGTH;
    }
    else
    {
        xFreeCertificate = pdTRUE;
    }

