NoMaY-jp/amazon-freertos-ex1/lib/pkcs11/portable/renesas/rx65n-envision-kit/pkcs11.c
    /*
     * Check parameters.
     */

    if( ( CK_BBOOL ) CK_FALSE == pxSession->xFindObjectInit )
    {
        xResult = CKR_OPERATION_NOT_INITIALIZED;
    }
    else
    {
        /*
         * Clean-up find objects state.
         */

        pxSession->xFindObjectInit = CK_FALSE;
        pxSession->xFindObjectComplete = CK_FALSE;
        pxSession->xFindObjectClass = 0;
    }

    return xResult;
}

/**
 * @brief Begin a digital signature generation session.
 */
CK_DEFINE_FUNCTION( CK_RV, C_SignInit )( CK_SESSION_HANDLE xSession,
                                         CK_MECHANISM_PTR pxMechanism,
                                         CK_OBJECT_HANDLE xKey )
{   /*lint !e9072 It's OK to have different parameter name. */
    ( void ) ( xSession );
    ( void ) ( pxMechanism );
    ( void ) ( xKey );

    return CKR_OK;
}

/**
 * @brief Digitally sign the indicated cryptographic hash bytes.
 */
CK_DEFINE_FUNCTION( CK_RV, C_Sign )( CK_SESSION_HANDLE xSession,
                                     CK_BYTE_PTR pucData,
                                     CK_ULONG ulDataLen,
                                     CK_BYTE_PTR pucSignature,
                                     CK_ULONG_PTR pulSignatureLen )
{   /*lint !e9072 It's OK to have different parameter name. */
    CK_RV xResult = CKR_OK;
    P11SessionPtr_t pxSessionObj = prvSessionPointerFromHandle( xSession );

    /*
     * Support length check.
     */

    if( NULL == pucSignature )
    {
        *pulSignatureLen = pkcs11SUPPORTED_KEY_BITS / 8;
    }
    else
    {
        /*
         * Check algorithm support.
         */

        if( ( CK_ULONG ) cryptoSHA256_DIGEST_BYTES != ulDataLen )
        {
            xResult = CKR_DATA_LEN_RANGE;
        }

        /*
         * Sign the data.
         */

        if( CKR_OK == xResult )
        {
            if( 0 != pxSessionObj->pxCurrentKey->pfnSavedMbedSign(
                    pxSessionObj->pxCurrentKey->pvSavedMbedPkCtx,
                    MBEDTLS_MD_SHA256,
                    pucData,
                    ulDataLen,
                    pucSignature,
                    ( size_t * ) pulSignatureLen,
                    mbedtls_ctr_drbg_random,
                    &pxSessionObj->xMbedDrbgCtx ) )
            {
                xResult = CKR_FUNCTION_FAILED;
            }
        }
    }

    return xResult;
}

/**
 * @brief Begin a digital signature verification session.
 */
CK_DEFINE_FUNCTION( CK_RV, C_VerifyInit )( CK_SESSION_HANDLE xSession,
                                           CK_MECHANISM_PTR pxMechanism,
                                           CK_OBJECT_HANDLE xKey )
{   /*lint !e9072 It's OK to have different parameter name. */
    ( void ) ( xSession );
    ( void ) ( pxMechanism );
    ( void ) ( xKey );

    return CKR_OK;
}

/**
 * @brief Verify the digital signature of the specified data using the public
 * key attached to this session.
 */
CK_DEFINE_FUNCTION( CK_RV, C_Verify )( CK_SESSION_HANDLE xSession,
                                       CK_BYTE_PTR pucData,
                                       CK_ULONG ulDataLen,
                                       CK_BYTE_PTR pucSignature,
                                       CK_ULONG ulSignatureLen )
{   /*lint !e9072 It's OK to have different parameter name. */
    CK_RV xResult = CKR_OK;
    P11SessionPtr_t pxSessionObj = prvSessionPointerFromHandle( xSession );

    /* Verify the signature. */
    if( 0 != pxSessionObj->pxCurrentKey->xMbedPkInfo.verify_func(
        pxSessionObj->pxCurrentKey->pvSavedMbedPkCtx,
        MBEDTLS_MD_SHA256,
        pucData,
        ulDataLen,
        pucSignature,
        ulSignatureLen ) )
    {
        xResult = CKR_SIGNATURE_INVALID;
    }

    /* Return the signature verification result. */
    return xResult;
}

/**
 * @brief Generate cryptographically random bytes.
 */
CK_DEFINE_FUNCTION( CK_RV, C_GenerateRandom )( CK_SESSION_HANDLE xSession,
                                               CK_BYTE_PTR pucRandomData,
                                               CK_ULONG ulRandomLen )
{   /*lint !e9072 It's OK to have different parameter name. */
    P11SessionPtr_t pxSessionObj = prvSessionPointerFromHandle( xSession );

    if( 0 != mbedtls_ctr_drbg_random( &pxSessionObj->xMbedDrbgCtx, pucRandomData, ulRandomLen ) )
    {
        return CKR_FUNCTION_FAILED;
    }

    return CKR_OK;
}


/* Renesas */
// XXX
int FLASH_update(uint32_t dst_addr, const void *data, uint32_t size)
{
    uint32_t    i;
    flash_err_t err;
    volatile uint32_t addr;
    uint32_t    size_blk;
	uint32_t * src_addr = (uint32_t *) data;

    /* Open driver */
    err = R_FLASH_Open();
    if (err != FLASH_SUCCESS) return -1;

    /* Erase code flash block */
    addr = dst_addr;
    if ((size%64) == 0)
    {
        size_blk = (int)(size/64);
    }
    else
    {
        size_blk = (int)(size/64) + 1;
    }

    err = R_FLASH_Erase(dst_addr, (size_blk/64));
    if (err != FLASH_SUCCESS) return -1;

    while (addr < (dst_addr + size_blk))
    {
        err = R_FLASH_Write((uint32_t)src_addr, addr, size_blk);
        if(err != FLASH_SUCCESS) return -1;

        /* Verify code flash write */
        for (i = 0; i < size_blk; i++)
        {
            if (*((uint8_t *)(src_addr + i)) != *((uint8_t *)(addr + i)))
            {
                return -1;
            }
        }

        addr += size_blk;
    }

    return size_blk;
}

